{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"Where are the visitors","text":"","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"The Baltic Seminar Notes \\# 2","text":"","link":"/2021/01/29/Baltic_2/"},{"title":"The Baltic Seminar Notes \\# 3","text":"","link":"/2021/02/03/Baltic_3/"},{"title":"The Baltic Seminar Notes \\# 1","text":"","link":"/2021/01/21/Baltic_1/"},{"title":"《先天性》：阅读笔记","text":"《先天性》，节选自阿尔弗雷德·朱尔斯·艾耶尔《语言，真理和逻辑》收录在《数学哲学》第三编：数学真理 我感觉这篇文章的主要思想还是和我很贴近的。主要在以下方面： 经验论的数学哲学：不存在关于现实的先天知识。数学无关乎现实世界，数学命题是分析命题。在现实世界的（“出乎意料的”）有效性是纯粹偶然的。对于更一般的科学来说，所有科学命题都是“大概的假设”。 数学是有意义的，但数学命题的意义并非在于其在物理世界的映照，而是在于论证分析命题在我们的世界（一个低智商人群组成的世界）是合理的。“一个具有无限智力的人对逻辑和数学毫无兴趣。” 批驳康德主义唯理论：“5+7=12”不是综合命题，是分析命题，错误的根源在于康德使用了非逻辑的论据；几何学是分析的且无关乎人类空间直觉的，因为几何学也不描述物理世界：康德受到了时代的限制。（康德的这个错误常常使得现代数学家忍俊不禁。） 因此我说，数学就其最本质形式而言，毫无疑问是重言式和纯粹分析的命题。但就其根源而言，我们受到我们物理世界和生物本性的限制，我们会选择那些和我们更相关的公理或起点进行演绎，甚至我们的演绎规则也与之相关。但这一点和认识论无关。 在这篇文章的开头，作者还批驳了密尔所言， “密尔坚持认为逻辑和数学的真理不是必然的或确定的。他坚持说这些命题是依据极多次数的事例所做的归纳概括。” 艾耶尔先天性 这个就不详细说了，因为这种主张在当今与主流数学观相悖。我在后面主要说一下数学的意义和对康德数学哲学的批判。 康德，就像大家都知道的那样，主张数学命题是“先天综合判断”，也就是既是先验的，也是非分析的。他对于分析和综合的界限被认为是模糊的，因为康德明显在某些地方混用了心理学和纯逻辑的例子。 “因为如前所见，他认为命题‘7+5=12’是综合命题的理由是‘7+5’的主观内涵不包含‘12’的主观内涵；而他认为‘所有物体都是延伸的’是一个分析命题的理由仅仅是根据矛盾律。” 艾耶尔先天性 因此，这种判断的差别性将会使得综合命题产生于一个心理判据之中，而分析命题产生于一个逻辑判据之中。这或许与康德的本意是相悖的，而他并没有意识到这个错误。因此，作者建议将分析和综合的定义改为： “我想，如果我们说一个命题，当它的有效性完全依靠他所含有的符号定义时是分析的，当它的有效性由经验事实所确定时是综合的，那么……”^1 艾耶尔先天性 那么数学命题就其本质而言，一定是分析的了。因为数学定理的真值完全取决于其证明中那些被认为本质上更真的命题和纯粹逻辑形式。或者说，完全取决于其中涉及到的每一词语的定义。因此数学必然是分析的。 但是，如“我是我自己”这种分析命题让人感到无聊一样，我们必须将数学意义确定下来。 “于是我们看到，存在着一种意义，在这一以上，分析命题确实给我们提供新知识。” 艾耶尔先天性 有意义的数学命题并非是废话，即便它的确是重言式。其中的依据在于，我们并非像一些逻辑哲学中主张的对逻辑的机械性似乎“无所不知”。我们的智力仍然是有限的，这使得我们无法像对待三段论这样的简单推理过程一样对待数学命题。如果我说，“五次方程不具有代数解”，那么即便我们每个人都知道五次方程和代数解“为”何物，我们仍然不能直观到这句话的真值如何。 但是我们要注意一个问题，即分析的数学是否可以归约为纯粹逻辑。作者认为是不能的， “一个分析命题的有效性绝不依靠于它能从其他分析命题推出，这一事实使我们有理由漠视数学命题是否能像罗素所设想的那样归约为形式逻辑命题这个问题。” 艾耶尔先天性 即每一个分析命题都是独立自足的。理论上来说，分析命题就它自己为真。一个知道什么叫方程的小学生，如果其智力超常，都可以证明“五次方程不具有代数解”。我觉得这点应该与作者的时代和罗素本人的主张有点儿关系，但我现在还不甚清楚。 最后，总结一些金句： “正像维特根斯坦所说的，我们认为，不能想象世界违反逻辑规律的理由，只不过是我们不能说出一个非逻辑的世界应是什么样的。” “因为一个选择的好的定义将引起我们对分析真理的主义，否则这种真理会从我们面前溜走。而构造合用的和富有成果的定义很可以被看成一种创造性的活动。” 艾耶尔先天性 注释：^1: 我在写的时候突然意识到这种定义方法和康德的存在一定相似性。我的根据在于，我们如何分辨形式证明和经验证明能力的界限呢？打个比方就是，一个数学规范较差的人会尝试实验来判断一个数学命题的真假，那么我们显然不能因此说该判断是正确的。因此，这个命题其实是说的关于一个命题类的性质。 因此，集合论中的独立命题似乎是一个搅局者。它在某一些模型中对，在某一些模型中错，而且我们对集合论模型具有着确切的定义。最为合适的例子就是ZFC，即，我们只能在经验上说Con(ZFC)具有一定的合理性。或许对于这个问题我还需要深入的思考。","link":"/2020/09/23/Reading_Notes/"},{"title":"Course Notes of Axiomatic Set Theory","text":"This is a collective course note taken in Prof. Simon Thomas’ course Axiomatic Set Theory of Rutgers University, which is held on Spring semester, 2019. The main topic of this course is forcing, forcing axioms such as $\\mathbf{MA}$, Open Coloring Axiom, Axiom A of Baumgartner and the Proper Forcing Axiom of Shelah. Also, this course discussed the relation among themselves and basic independent statements like $\\mathbf{CH}$. The main reference would be Kunen’s book and Jech’s book. If there is any mistakes or comments, please feel free to contact me.","link":"/2020/09/24/Course-Notes/"},{"title":"Ralf Schindler - Talk 1 on Logic Summer School of Fudan University, 2020","text":"Content: Stationary sets; Forcing revisited; Forcing Axioms: $\\mathbf{MA}$; Proper forcing; semi-proper forcing; stationary set preserved forcing; $\\mathbf{PFA}$, $\\mathbf{SPFA}$, $\\mathbf{MM}$.","link":"/2020/11/24/Talk1/"},{"title":"Ralf Schindler - Talk 2 on Logic Summer School of Fudan University, 2020","text":"Content: Restate $\\mathbf{PFA}$, $\\mathbf{SPFA}$, $\\mathbf{MM}$ as well as $\\mathbf{PFA}^{++}$, $\\mathbf{SPFA}^{++}$, $\\mathbf{MM}^{++}$; A few words on iterated forcing Supercompact Cardinals, Laver functions; Forcing $\\mathbf{SPFA}^{(++)}$ Weak reflection principle; $\\mathbf{MM}\\Rightarrow2^{\\aleph_1} = \\aleph_2$.","link":"/2020/11/24/Talk2/"},{"title":"Ralf Schindler - Talk 3 on Logic Summer School of Fudan University, 2020","text":"Content: discuss some aspects of stationary sets; $\\mathbf{MM}\\implies 2^{\\aleph_1}=\\aleph_2$; effective counterexample to $\\mathbf{CH}$.","link":"/2020/09/12/Talk3/"},{"title":"Ralf Schindler - Talk 4 on Logic Summer School of Fudan University, 2020","text":"Content: Show a characterization of precitiousness; $V$ is generically iterable with respect to precitious ideals; Discussion of effecitive counterexamples to $\\mathbf{CH}$. Illustrations of Admissible Club Guessing(ACG)$\\implies \\mathfrak{u}_2 = \\omega_2$. Prove ACG follows from $\\mathbf{MM}$.","link":"/2020/09/23/Talk4/"},{"title":"Forcing Over CH","text":"Let $\\mathbb P = Fn(\\omega_2\\times\\omega,2)$ be the collection of all the finite partial functions from $\\omega_2\\times \\omega$ to $2$. Our strategy is: to firstly find a collection of dense sets $D_{\\alpha\\beta}$, such that a generic filter $G$ can be build upon; to secondly prove that any generic filter of $\\mathbb P$ preserves cardinals. Lemma. 1 $D_{\\alpha\\beta}$ are dense sets, where$$D_{\\alpha\\beta} = {p\\in\\mathbb P\\mid \\exists n\\in\\omega(\\langle\\alpha,n\\rangle\\in dom(p), \\langle\\beta,n\\rangle\\in dom(p),p(\\alpha,n)\\neq p(\\beta,n))}.$$ Thus, for any generic filter $G\\subseteq \\mathbb P$, $G\\cap D_{\\alpha\\beta}\\neq\\emptyset$ and thus $\\bigcup G$ is a function $\\omega_2\\times\\omega\\to 2$. Given that $\\mathbb P$ satisfies c.c.c.$^1$, we have Lemma. 2 $\\mathbb P$ preserves cofinality and thus preserves cardinals. Proof. Let $\\kappa$ be a regular cardinal which witnesses the change of cofinality. Thus, there are $\\alpha&lt;\\kappa$ and $f:\\alpha\\to \\kappa,f\\in V[G]$ which maps $\\alpha$ cofinally into $\\kappa$. Given that $\\mathbb P$ satisfies c.c.c., we can find a $F:\\alpha\\to P(\\kappa)$ in $V$ such that: $\\forall\\xi&lt;\\alpha(f(\\xi)\\in F(\\xi))$; $\\forall\\xi&lt;\\alpha(|F(\\xi)|\\leq\\omega)^{V2}$. Thus, let $S = \\bigcup_{\\xi&lt;\\alpha}F(\\xi)$, we have that $S$ is unbounded in $\\kappa$, and $|S| = |\\alpha| = \\kappa$, contradicting the regularity of $\\kappa$.$\\square$ By the above lemmas, for any generic filter $G\\subseteq V$, $\\bigcup G$ is a function from $\\omega_2\\times\\omega\\to 2$, which results in $\\omega_2$ many different $\\omega\\to 2$ functions. And since $\\omega_2$ is preserved in $V[G]$, we may say that $V[G]\\vDash \\neg CH$. $^1$ About the c.c.c. property of $\\mathbb P$: Suppose $A = {p_\\alpha\\mid \\alpha&lt;\\omega_1}$ is an uncountable antichain of $\\mathbb P$, then it is safe to assume that ${dom(p_\\alpha)}$ is a Delta system. Let $r$ be its root, then we can forwardly assume that all $p_\\alpha$ agrees on $r$. Thus all $p_\\alpha$ are compatible with each other. $^2$ See Lemma. 5.5 of Chap. VII of Kunen’s book.","link":"/2020/09/12/Test/"},{"title":"Ralf Schindler - Talk 5 on Logic Summer School of Fudan University, 2020","text":"Content: Finish the last theorem of the last lecture: Force by a stationary set preserving forcing: $$(M;\\in,I)\\xrightarrow[\\text{of length } \\omega_1]{\\text{generic iteration}}(H_{\\omega_2}^V;\\in,\\mathbf{NS}_{\\omega_1}^V),$$ where $M$ is a generically iterable countable transitive structure. $\\Bbb P_{\\max}$ forcing and analysis of $L(\\Bbb R)^{\\Bbb P_{\\max}}$; $(\\ast)$ and: $\\mathbf{MM}^{++}\\implies(\\ast)$.","link":"/2020/09/23/Talk5/"},{"title":"杂感","text":"“理论要用来培养未来指挥官的智力，更准确地说，理论应当促使他们自修，而不是跟着他们一起上战场。这好比高明的老师要做的是启发和促进学生发展智力，而不是一辈子牵着他们走路一样。” 克劳塞维茨战争论 评论：这段话应用范围之广使得《战争论》一书的哲学性显露无疑。我现在怀疑这句话是否蕴含了某种认识论的哲学倾向，但还不好说。我们常说，“理论指导实践”，指导到底指的是什么？那么在这里，理论就是指南针，但却不是藏宝图。理论和人的自身理性天赋必须得到良好结合，真正的思想火花才能迸发出来。理论给我们指明可能的方向，在一片原野上设立路标，但就其本身而言，并不指涉特定的进路。然而，个人精力的（可悲的）有限性往往使得我们一生只能追寻一条特定的进路，而这样的人就被尊称为某理论家。 所以，现在来说，我的观点是：理论和思想本身不等同。理论是思想的外化，而思想是理论的内化。外化和内化是互相独立的两个路径，而且和理解过程也是独立的。还是拿我那贫乏的知识和智力举例吧：我刚开始学习集合论的时候，脑子里还只有ZFC的纸面内容，还只有集合的自然观念，还只有一些关于序数和基数的规定性内容。但是要注意的是：知识是必要的规定，而理论并不必然是规定，思想就与规定大相径庭。我自认为，在这一阶段我尚未理解集合论的基本问题和大致方向；然而深入再学习之后，在我了解了clubs，trees，forcing和inner models，我才在盘根错节的知识中梳理出一条线索，并认为研究关于集合论宇宙的基本结构是其中最有趣的问题。当然，这也部分归咎于哥德尔对我的影响还有我自己对于描述集合论知识的欠缺。我还是始终在追求一种对于整全的理解。内化的过程，即是从知识派生出理论，理论派生出思想的过程。知识就其本身来说是相对次要的： “在人类生活中的许多活动中，就算人们所学的知识已经忘得差不多了，人们在需要时也可以从满是灰尘的书本里去寻找，甚至人们日常所用的知识也可能完全是身外之物。” 克劳塞维茨战争论 在数学界，证明是一种技术性工作，无论以什么样的溢美之词赞誉它。能证明书中的任意一个定理被视为一种教师的基本能力（虽然是一个许多人达不到的能力），并且是一个学生足以夸夸其谈的能力；但证明永远不是数学的核心。数学研究的核心是关照并理解那些已经被加以完全的抽象化的数学实体与数学结构（虽然哲学家声称有更高的目标，但在此不再赘述），因此猜想、定义和证明往往是同步进行的。证明不过是翻山越岭，即使往往路途艰辛；而研究则是鸟瞰与测绘，即使偶尔损失一些细节。因此，一个成熟的数学家就不得不谨慎处理自己的角色：一会儿是冒险家，一会儿是地理学家，一会儿又是哲学家。缺失任何一个角色都使得自己的工作显得单薄无力。 关于数学哲学我还有一些想说的：我现在仍然认为，在对于数学实体的关照上，数学和哲学存在某种显见的竞争关系。这种竞争关系往往体现在研究路径的不同上，而导致数学哲学本身并不是一个同质的学科。尤其是在集合论这种肩负着某种奠基性使命的学科依旧如此。数学所立足的基础，往往是以已经存在的构造为主；而这些概念一经数学的抽象，便具有了特定的学术角色，脱离了先前其存在的背景（例如物理学的、统计学的或其他数学分支的）。因此，它们藉由数学家朴素的理论直观而存在，这并不需要某种形而上的辩护。 所以我目前为止相信一种以朴素直观和实践为主的数学哲学观念。同样，我也相信集合论是全数学“数学”上的基础，和数学实体形而上的理念完全无关。这或许和经验论的路径有相似之处，但注意我在这里并没有说明数学何以可能这个问题，因为我感觉这个问题和数学实践没什么关系，也和大部分现存的数学工作无关。 “大约在19，20世纪之交，数学——‘可靠性与真理性的典范’——似乎是正统的欧几里得学派的真正最后堡垒。但是，甚至欧几里得式的数学结构也必定存在一些缺点，这些缺点使人感到严重不安。因此，所有基础学派的中心问题是：‘一劳永逸地建立数学方法的确实性。’可是，基础研究却出乎意料地得到结论：作为总体来看，按照欧几里得方式重组数学也许是不可能的；至少最有意义的数学理论，像自然科学理论一样，是拟经验的。欧几里得注意在它的真正堡垒中遭到失败了。” 拉卡托斯数学，科学和认识论 不得不说，若是有哪位现代哲学家仍然将数学的“不可谬性”奉若圭臬，那可真是一件令人感到可笑的事情。数学家大抵都明白，数学的不可谬性是一种表面的、技术的不可谬性，是无关乎实证主义的；而数学界对于不同理论的选择可以说是无时无刻不在发生，旧有理论被抛弃，新的进路被发现，对于旧事物整体的、抽象的新认识无时无刻不在取代着旧认识。重组数学使得其满足某种预设的哲学观念在我看来也是颇为荒谬的：显然让数学家们抛弃其旧有的、富足的关于数学的朴素直观，去迁就具有某种哲学特殊性的故事是一种不必要的限制。数学的最好图景就像一个可以缓慢前进的元胞自动机程序，混沌中却有一点点秩序可以寻得。而这种秩序，我现在认为，已经超出了人类语言所能描述的范围。","link":"/2020/09/12/Toughts/"},{"title":"Draft of My Fine Structure Notes","text":"Notice: This is a Reading note of the Handbook article written by Zeman &amp; Schindler, about basics of fine structure theory. The notation may vary but the enumeration of theorems, lemmas and corollaries are the same. Things I have written so far Part I: Rudimentarily Closed &amp; Definability; $S^A_\\gamma$ and $&lt;^A_\\gamma$; Part II: $\\Sigma_1$-definability of $S^A_\\gamma$ and $&lt;^A_\\gamma$; $\\Sigma_1$-Satisfaction and the Skolem function; Condensation Lemma; Part III: Acceptability &amp; Consequences; $\\Sigma_1$-Projectum. Part IV: Reducts &amp; Good Parameters; Downward &amp; Upward Extension. Things I am planning to add inConstructibility $\\mathcal L_V$ Theory $Fml(x)$. Mind the absoluteness. Basic Set Theory. $\\Sigma_0$ Comprehension. Definability &amp; Rudimentary Closed. Applications: $\\square_\\kappa$ holds in $L$; Jensen’s Preprint Book Admissibility; Recursion Theory, similar argument like rudimentarily closedness Aim: To give a new way of describing the constructible hierarchy by levels and to apply the uniform $\\Sigma_1$-definable $\\Sigma$-Skolem function in $\\Sigma_n$-Skolem functions, which are not uniformly definable.Part 1: Rudimentarily Closed &amp; DefinabilityRudimentarily Closed: A structure $M = \\langle |M|,\\in,A\\rangle$ that is closed under following function schemas: $f(\\vec{x}) = \\vec x(i)$; (Admissibility)$f(\\vec x) = \\vec x\\cap A$; $f(\\vec x) = {\\vec x(i),\\vec x(j)}$; $f(\\vec x) = \\vec x(i) - \\vec x(j)$; $f(\\vec x) = \\bigcup_{y\\in \\vec x(0)} g(\\langle y,x_2,…,x_n\\rangle)$; $f(\\vec x) = h(\\vec g(\\vec x))$; The collection(as a proper class) of all these functions (called the $rud_A$ functions)is defined independent with the structure. A relation is called $rud_A$ if its characteristic function is $rud_A$. $rud_\\emptyset$ is simplified as $rud$. A variety of functions and relations like $\\not\\in$ and $x’’y$ can be regarded as $rud_A$ or $rud$(See Handbook). The closure of $rud_A$ functions is denoted as $rud_A(M)$. Notice that here $M$ itself cannot be referred as a $\\vec x(i)$. The $J$-Hierarchy is defined very similar as the $L$-Hierarchy, but only use the limit ordinals. $J^A_0 = \\emptyset$ and for limit ordinal $\\alpha$, $J^A_{\\alpha\\omega} = \\bigcup_{\\gamma&lt;\\alpha}J^A_{\\gamma\\omega}$. For successor ordinals, $J^A_{\\alpha+\\omega} = rud_A(J^A_{\\alpha}\\cup{J^A_{\\alpha}})$. Actually, Lemma 1.4 shows by induction that $L_\\alpha = J_\\alpha$ if $\\alpha$ is a limit ordinal. One may argue that the collection of $rud_A$ functions could be very complicated due to the function generating schemas(the last two). Thus we introduce the idea of auxillary hierarchy, denoted as $S^A_\\alpha$. It is defined via the closure of 15 defined functions $V^2\\to V$, and it actually uses all the ordinals. Fact. $S^A_\\alpha = J^A_\\alpha (=L_\\alpha[A])$ if $\\alpha$ is a limit ordinal. After introducing the preliminaries, we can now discuss the relation between constructibility and $rud_A$ closedness. Remember that $L_\\alpha \\subseteq \\mathcal P(L_\\alpha)$ due to its definition. Lemma 1.4 Let $U$ be a transitive structure with $A\\cap V_{rank(U)+\\omega}\\subset U$. Then $\\mathcal P(U)\\cap rud_A(U\\cup{U}) = \\mathcal P(U)\\cap \\mathbf\\Sigma_\\omega^{\\langle U,\\in,A\\rangle}$. In particular, $J^A_{\\alpha+\\omega}\\cap \\mathcal P(J_\\alpha) = def_A(J_\\alpha)$. Remark. As we shall show later, $rud_A$ functions can only add a finite amount of rank to its variables. Thus to restrict $A\\cap V_{rank(U)+\\omega}\\subset U$, we actually let the $rud_A$ functions be $rud_{A\\cap U}$ functions. $$\\mathcal{P}(U) \\cap \\Sigma_{\\omega}^{\\langle U, \\in, A\\rangle}=\\mathcal{P}(U) \\cap \\Sigma_{0}^{\\langle U \\cup{U}, \\in, A \\cap U\\rangle},$$ since now all the quantifiers are bounded. Now we only need to show that$$\\mathcal P(U)\\cap rud_A(U\\cup{U}) = \\mathcal P(U)\\cap \\mathbf\\Sigma_0^{\\langle U \\cup{U}, \\in, A \\cap U\\rangle}.$$ “$\\supseteq$” By induction we can say that every $\\Sigma_0$-definable relation would be $rud_A$. Thus for every $x\\in\\mathcal{P}(U) \\cap \\Sigma_{0}^{\\langle U \\cup{U}, \\in, A \\cap U\\rangle}$, $y\\in x$ iff $y\\in U$ and for some $\\vec x\\in U^k$, $R(y,\\vec x)$ is true for some $rud_A$ relation $R$. To get $U\\cap {y:R(y,\\vec x)}\\in rud_A(U\\cup{U})$ we need to use the fact that $f(y,\\vec x) := y\\cap{z:R(z,\\vec x)}$ is $rud_A$ if $R$ is $rud_A$. “$\\subseteq$” Prove by induction that every $rud_A$ function $f$ satisfies the following property: $v_0\\in f(v_1,…,v_m)$ is equivalent with a $\\Sigma_0$ formula. (Here the assumption in the Remark is required.) Hence, all sets defined like ${y\\in U:y \\in f(x_1,…,x_n)}$ is in $\\Sigma_0^{\\langle U\\cup{U},\\in,A}({x_1,…,x_n})$. $\\square$ Question. What is the maximal/minima ordinal that is/isn’t $\\Sigma_0$-definable without parameter? $\\omega$ surely satisfies the condition. Moreover, what about the $\\Sigma_{n/\\omega}$-definable ordinals? Answer. For $\\Sigma_0$-definable ordinals, they are referred as the recursive ordinals. $\\omega_1^{CK}$ is the supremum of them, but not recursive itself. Remark. The core idea of this proof is that $\\Sigma_0$-definable relations are also $rud_A$, and the converse is also true. It is quite difficult to see in the direct defintion of $rud_A$, but if one refers to the auxillary hierarchy, then it becomes clear. Example. Not all $\\Sigma_0$ functions (in $ZF$) are rudimentary: $f:x\\mapsto \\omega$ gives an example of $\\Sigma_0$-definable functions which are not rudimentary. The point is, it is easy to verify that every rudimentary function has the so-called finite rank property: Fact. If $f:V^k\\to V$ is $rud$, then there is a $n\\in\\omega$ such that:$$f(x_1,…,x_k)&lt;\\max_{i\\leq k}(rank(x_i))+n.$$$\\square$ Part 2: Problems arised in $L$-HierarchyBeing another construction of $L[A]$, the $J$-Hierarchy has many properties that is very similar with the $L$-Hierarchy. Actually many theorems and lemmata are made in comparision with the $L$-Hierarchy. In the Handbook article, the authors introduced many interesting properties of $J$-Hierarchy. Many similar properties (as well as their proofs) are also included in Devlin’s book Constructibility. Our next goal is to show that in the $J$-Structure, there is a uniformly $\\Sigma_1$-definable $\\Sigma_1$ Skolem function. We shall remark the usefulness of this statement at the end of this part. The proofs and explanations are quite tedious, so I just listed all relevant results below. “$x=J_\\beta^A$” is uniformly $\\Sigma_1$-definable over $J_\\alpha^A$ where $\\beta&lt;\\alpha$. Similarly, a well-ordering $&lt;^A_\\beta$ is uniformly $\\Sigma_1$-definable over $J_\\alpha^A$ where $\\beta&lt;\\alpha$. The satisfaction $\\vDash^{\\Sigma_0}_M$ is $\\Delta_1$-definable. Thus $\\vDash^{\\Sigma_1}_M$ is $\\Sigma_1$-definable. (Condensation) Any transitive structure that is $\\Sigma_1$-embeddable into some $J$-structure is itself a $J$-structure. If $\\alpha$ is closed under Godel’s Pairing funcion (in particular, $\\alpha$ is a cardinal), then there is a $\\Sigma_1$-definable function $f:\\alpha\\to J_\\alpha^A$ without parameter. For arbitrary $\\alpha$ the function requires parameters. Another usage of the auxillary hierarchy is the $\\Sigma_1$-definition of itself and a well-ordering: Lemma. Both $\\langle S^A_\\gamma:\\gamma&lt;\\alpha\\rangle$ and $\\langle &lt;^A_\\gamma:\\gamma&lt;\\alpha\\rangle$ are $\\Sigma_1^{J^A_\\alpha}$ uniformely definable(the definition does not depend on $\\alpha$). Remark. It is easy to show by induction which is discussed in Jensen’s notes and the Handbook article in detail. We only need to notice that the $\\exists$ quantifier is used to declare the level. Definition. Denote $#(\\phi(a))$ as the Godel number of the $\\Sigma_0$-sentence $\\phi(a)$, with $a$ being the free variable. We call the function$$f:\\omega\\to M, #(\\phi(a))\\mapsto x$$the $\\Sigma_1$ Skolem function iff $M\\vDash \\phi(x)$. Thus, $M$ satisfies the $\\Sigma_1$-sentence $\\exists a(\\phi(a))$. Remark. The Skolem function, in short, is a function that witnesses the truthfulness for the $\\exists$ quantifier. As Brouwer would agree, a existence sentence couldn’t be viewed as proved if the corresponding elements are not constructed. In Proposition 1.12, the defined function $f$ maps $i&lt;n$, the Godel number of some $\\Sigma_0$-formula(with some free variables), to the collection of all $v(i)$-tuple which satisfies the formula. Notice that $f$ is only a finite initial segment. Proof. The proof uses finite induction and for each regular step, uses the Lemma 1.1. That is, the ordered pair $\\langle n,T\\rangle$ we want to add is definable. We let $\\Theta(f,N,n)$ be the $\\Sigma_0$-formula which says that “$N$ is transitive, $f = f^N_n$ is defined like above”. Thus the predicate $\\vDash^{\\Sigma_0}_M$ would be $\\Delta_1$, and thus absolute. Thus for the $\\Sigma_1$-definable $\\Sigma_1$ Skolem function $h_M$, we only need to “pick out” some elements that is $\\Sigma_1$-definable in $f(i)$. The strategy is to pick the $&lt;^A_\\beta$-minimal element in $S^A_\\beta$, which we proved erlier that these two concepts are both $\\Sigma_1$. Question. I think the reason why he only uses the “first component” is to avoid further tedious problem of definable well-ordering in $n$-tuples of $S^A_\\beta$. However I am not quite sure why defining $\\Sigma_2$-Skolem function will need $\\Sigma_3$ definition. As an application, we shall now prove the condensation lemma for $J$-Structures. Theorem. Any transitive structure that is $\\Sigma_1$-embeddable into some $J$-structure is itself a $J$-structure. Proof. Let $\\pi:\\bar M\\xrightarrow[\\Sigma_1]{}M$ be such an emebdding, together with $M=\\langle J^A_\\alpha,\\in,B\\rangle$. Let $\\bar A=\\pi^{-1}A$, $\\bar B=\\pi^{-1}B$ and $\\bar \\alpha = \\bar M\\cap Ord$. Now we check $\\bar M = \\langle J^{\\bar A}{\\bar \\alpha},\\in,\\bar B\\rangle$. Clearly, by the $\\Sigma_1$-definability of $S^A_\\alpha$, for all $\\beta&lt;\\bar\\alpha$, $S^A{\\beta}\\in \\bar M$, thus $\\bar M=J^{\\bar A}_{\\bar \\alpha}$. For the other direction, only to notice that every $x\\in\\bar M$ is mapped to some $S^A_\\beta$ for $\\beta&lt;\\alpha$.$\\square$ Question. What is the usage of $B$ here?? Is $B$ really affecting the structure of $M$? I don’t think so. Remark. The below “Convention” is definitely misleading. I think $h_M[X]$ would be much better. Lemma. If $\\alpha$ is closed under Godel paring function, then tere is a surjection $g:\\alpha\\to J^A_\\alpha$ which is $\\Sigma^M_1$. For arbitrary ordinal, this function would be $\\mathbf\\Sigma^M_1$. Remark. I am not planning to include this proof right now, since we neither introduce the notion of Godel pairing function, nor it has anymore use for us at all. Anyhow, this lemma is interesting and useful. Part 3: Acceptability and the $\\Sigma_1$ ProjectumIn this part we start to construct some of the basic analysis of the $J$-Hierarchy. It turns out that under suitable assumption, $J^A_\\rho = H^M_\\rho$ and satisfies $ZFC^-$. For the $\\Sigma_1$-Projectum, we shall talk about some of the settings for our next note, about upward &amp; downward extension of embeddings. Definition. A $J$-Structure $M = \\langle J^A_\\alpha,B\\rangle$ is acceptable iff: Whenever $\\xi&lt;\\alpha$ is a limit ordinal and $\\tau&lt;\\xi$, if $\\mathcal P(\\tau)\\cap J^A_{\\xi+\\omega}\\not\\subseteq J^A_\\xi$, then there is a surjectve $f: \\tau\\to\\xi$ in $J^A_{\\xi+\\omega}$(or, $J^A_{\\xi+\\omega}\\vDash |\\tau|\\geq \\xi$.) Question. The authors wrote that the acceptability can be viewed as a strong version of $GCH$. What does it mean? According to the fact that $L[A]$(or $L_\\alpha[A]$) are not generally satisfying $GCH$, $A$ has to satisfy more properties. Acceptability is a $Q$-property with respect to the following definition. Definition. $Qv$(called “there are cofinally many $v$”) is the abbriviation of $\\forall u\\exists v\\supset u$. If $\\Phi$ is a (fixed) $Q$-sentence, we say a structure $M$ satisfy the $Q$-property defined by $\\Phi$ iff $M\\vDash \\Phi$. By a cofinal map $\\sigma:U\\to V$ we declare that $\\sigma$ possess the following property:$$\\forall y\\in V\\exists x\\in U(y\\subseteq \\sigma(x)).$$Clearly, $\\Sigma_1$-elementary embedding is $Q$-preserving downwards. Moreover, if the map is also cofinal, then it is also $Q$-preserving upwards. Thus, Corollary 1.22 Acceptability is downward absolute with respect to $\\Sigma_1$-elementary embeddings. Furthermore, it is (upward) absolute with respect to $Q$-elementary embeddings. Acceptable structures canbe more well-behaved. For example, Lemma 1.23 says that acceptable structures add no new subsets of sets that are already possessed by lower level with cardinal height. Proof. While using Lemma 1.17, note that every infinite cardinal is closed under Godel Pairing Function. Consider the surjection $g:\\tau\\to u$ and the preimage of some $a\\subset u$. Towards a contradiction, let the preimage not in $J^A_\\rho$. By definition of acceptability, suppose the preimage(a set of ordinals $&lt;\\tau$ and $\\Sigma_1$-definable) is contained in some $J^A_{\\xi+\\omega}-J^A_{\\xi}$, we have a surjection $f:\\tau\\to \\xi$ in $J^A_{\\xi+\\omega}$. Thus $\\tau\\geq\\xi\\geq\\rho$, which is impossible since $\\tau&lt;\\rho$. Thus the preimage is in $J^A_{\\rho}$ and $a\\in J^A_{\\rho}$. $\\square$ Corollary. $|J^A_\\rho| = H^M_{\\rho}$ provides that $J^A_\\rho$ is acceptable and $\\rho$ is a cardinal. Remark. The cardinal property make sure that its size is preserved in lower level.(The comparision of size in lower level is “true”.) Question. So let us now consider what makes an acceptable $J$-Structure: the set $A$ used to constrct the hierarchy and some ordinal $\\alpha$. Is Corollary 1.22 proves that all of the $J$-structure constructed from $A$ is acceptable? Should we refer to the Condensation Lemma? Lemma 1.24 Let $\\langle M,\\in, A\\rangle$ be an acceptable $J$-structure. Then for any $\\rho,\\alpha\\in Ord^M$, if $\\alpha\\subset J^A_\\rho$ and $Card(a)&lt;\\rho$ in $M$, then $\\rho$ being an infinite successor cardinal in $M$ gives $\\alpha\\in J^A_\\rho$. Proof.$\\square$ The proof of Lemma 1.23 gives us the intuition to find the $\\Sigma_1$ Projectum in some acceptable $J$-Structure. Definition. The $\\Sigma_1$ Projectum $\\rho(M)$ is defined as the least ordinal which satisfies$$\\mathcal P(\\rho(M))\\cap\\mathbf \\Sigma_1^M\\not\\subseteq M.$$ Remark. Equivalently, $\\rho = \\rho(M)$ is the $\\Sigma_1$-Projectum iff there exists a $\\mathbf{\\Sigma}_1$-definable function $f$ in $M = J^A_\\alpha$ such that$$f’’J^A_{\\rho} = J^A_\\alpha.$$ In our proof above, we actually shows that $\\Sigma_1$-Projectum can only be a $\\Sigma_1$-cardinal, which means there are no $\\Sigma_1$-definable surjection $f:\\tau\\to \\rho(M)$ for some $\\tau&lt;\\rho(M)$. In particular, $\\rho(M)$ would be a cardinal if $\\rho(M)\\in M$. Proof.$\\square$ Remark. The above theorem shows that the two definitions are indeed equivalent.(…) Part 4: Downward &amp; Upward ExtensionsRecall that our aim is to use the uniformly definable $\\Sigma_1$-Skolem function to analysis $\\Sigma_n$ properties. In this part we shall introduce some… Definition. Let $M = \\langle J^B_\\alpha,D\\rangle$ be an acceptable $J$-structure, $\\rho = \\rho(M)$ is the $\\Sigma_1$ Projectum and $p\\in M$. Then$$A_{M}^{p}=\\left{\\langle i, x\\rangle \\in \\omega \\times J_{\\rho}^{A} \\mid M \\vDash \\varphi_{i}(x, p)\\right}$$ is called the standard code determined by $p$. The strucure $M^p = \\langle J^B_\\rho,A^p_M\\rangle$ is called the reduct determined by $p$. Moreover, the set$$P_M = {p \\in[\\rho(M), M \\cap \\mathrm{On})^{&lt;\\omega}:\\exists B\\in\\Sigma^M_1({p})[B\\cap \\rho\\not\\in M]}$$ is called the set of good parameters; the set$$R_M = {r:p \\in[\\rho(M), M \\cap \\mathrm{On})^{&lt;\\omega}:h_M(\\rho\\cup{r}) = M}$$ is called the set of very good parameters. It is easy to see that $R_M\\subset P_M$, and both of them are non-empty. Now we would like to show that $\\Sigma_0$-elementary embeddings between reducts defined by very good parameters can be extended to the whole structure, which is also $\\Sigma_1$-preserving. Lemma 3.1 Let $\\pi: \\bar M^{\\bar p}\\xrightarrow[\\Sigma_0]{}M^p$, where $\\bar p\\in R_{\\bar M}$. Then there exists a unique extension $\\tilde \\pi:\\bar M\\xrightarrow[\\Sigma_0]{} M$ with $\\tilde\\pi(\\bar p) = p$. Moreover, $\\tilde \\pi$ is $\\Sigma_1$-preserving. Proof.$\\square$ Remark. The above lemma actually shows that every $\\Sigma_n$-elementary embedding between reducts can be extended to a unique $\\Sigma_{n+1}$-elementary embedding between the original structures, given that $p\\in R_M$ also. Proof.$\\square$ Now we can give a generalized Condensation Lemma for reducts defined by a very good parameter. Lemma 3.3. Let $\\pi:N\\xrightarrow[\\Sigma_0]{} M^p$, where $N$ is a $J$-strcture and $p\\in R_M$. Then there exists a unique $\\bar M$ and $\\bar p\\in R_{\\bar M}$ such that $N = \\bar M^{\\bar p}$. Proof.$\\square$ The above lemma, together with Lemma 3.1 and 3.2, is called the “downward extension of embeddings”. To give a dual lemma, we first notice that such a extension of the codomain may not exist. Thus, we need to strengthen the power of the embedding. Definition. A $\\Sigma_1$-elementary embedding $\\pi$ is called strong iff the well-foundedness of rudimentary functions with the same definition is preserved under $\\pi$. Lemma 4.1. Let $\\pi:\\bar M^{\\bar p}\\to N$ is strong, where $N$ is acceptable and $\\bar p\\in R_{\\bar M}$. Then there are unique $M$ and $p\\in R_M$ such that $N = M^p$. Moreover, the extended embedding $\\tilde \\pi:\\bar M\\xrightarrow[\\Sigma_1]{} M$ satisfies $\\tilde \\pi(\\bar p)=p$. Proof.$\\square$ Addendum: Application of Fine Structure: $L\\vDash \\square_\\kappa$ Addendum: Logic embedded in $V$Other remarks Reference[1] Handbook article of Zeman &amp; Schindler; [2] Devlin’s book Constructibility; [3] Jensen’s unpublished notes Manuscript on fine structure, inner model theory, and the core model below one Woodin cardinal. It is on his personal website. [4] Sy D. Friedman’s book Fine Structure and Class Forcing; [5] Jensen’s original paper of $J$-Hierarchy The fine structure of the constructible hierarchy;","link":"/2020/10/10/Fine_Structure/"}],"tags":[{"name":"Seminar-Notes","slug":"Seminar-Notes","link":"/tags/Seminar-Notes/"},{"name":"Set-Theory","slug":"Set-Theory","link":"/tags/Set-Theory/"},{"name":"Reading-Notes","slug":"Reading-Notes","link":"/tags/Reading-Notes/"},{"name":"Philosophy-of-Mathematics","slug":"Philosophy-of-Mathematics","link":"/tags/Philosophy-of-Mathematics/"},{"name":"Course-Notes","slug":"Course-Notes","link":"/tags/Course-Notes/"},{"name":"Talks","slug":"Talks","link":"/tags/Talks/"},{"name":"Ralf-Schindler","slug":"Ralf-Schindler","link":"/tags/Ralf-Schindler/"},{"name":"Fudan-Logic-Summer-School","slug":"Fudan-Logic-Summer-School","link":"/tags/Fudan-Logic-Summer-School/"},{"name":"Notes","slug":"Notes","link":"/tags/Notes/"},{"name":"Test-files","slug":"Test-files","link":"/tags/Test-files/"}],"categories":[{"name":"Notes","slug":"Notes","link":"/categories/Notes/"},{"name":"Others","slug":"Others","link":"/categories/Others/"}]}